<a href="https://colab.research.google.com/github/peterdelaguila/peterdelaguila/blob/main/organizing_manipulating_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Organizing and manipulating data in python

In [ ]:
import os
os.getcwd()
os.chdir('C:\\Users\\PDELAGUILA\\Dropbox\\UNI\\XPEBIBA\\07 Business Analytics Advanced')

In [ ]:
import pandas as pd
d = {'A': [0, 1, 0],
     'B': [1, 0, 1],
     'C': [1, 0, 0]}
pd.DataFrame(d)

   A  B  C
0  0  1  1
1  1  0  0
2  0  1  0

In [ ]:
dp = pd.read_csv("C:\\Users\\PDELAGUILA\\Dropbox\\UNI\\XPEBIBA\\07 Business Analytics Advanced\\dist-Aus.csv") 
dp.head(2)

  Unnamed: 0     A    AS     B     D     H     M     P     S
0          A     0  1328  1600  2616  1161   653  2130  1161
1         AS  1328     0  1962  1289  2463  1889  1991  2026

In [ ]:
dp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  8 non-null      object
 1   A           8 non-null      int64
 2   AS          8 non-null      int64
 3   B           8 non-null      int64
 4   D           8 non-null      int64
 5   H           8 non-null      int64
 6   M           8 non-null      int64
 7   P           8 non-null      int64
 8   S           8 non-null      int64
dtypes: int64(8), object(1)
memory usage: 704.0+ bytes

In [ ]:
dp = pd.read_json("C:\\Users\\PDELAGUILA\\Dropbox\\UNI\\XPEBIBA\\07 Business Analytics Advanced\\data.json") 
dp[['id','timestamp']].head()

           id           timestamp
0  7031047350 2020-04-08 01:04:00
1  7031047340 2020-04-08 01:04:00
2  7031047338 2020-04-08 01:04:00
3  7031047336 2020-04-08 01:04:00
4  7031047335 2020-04-08 01:04:00

In [ ]:
dp.columns

Index(['id', 'sampling_rate', 'timestamp', 'location', 'sensor',
       'sensordatavalues'],
      dtype='object')

In [ ]:
dp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14118 entries, 0 to 14117
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                14118 non-null  int64
 1   sampling_rate     0 non-null      float64
 2   timestamp         14118 non-null  datetime64[ns]
 3   location          14118 non-null  object
 4   sensor            14118 non-null  object
 5   sensordatavalues  14118 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 661.9+ KB

In [ ]:
dp.dtypes

id                           int64
sampling_rate              float64
timestamp           datetime64[ns]
location                    object
sensor                      object
sensordatavalues            object
dtype: object

In [ ]:
my_list=[['male',1,None],['female',2,3],['male',3,4]]
dp=pd.DataFrame(my_list,columns=['A','B','C'])
dp=dp.fillna(-99)
dp

        A  B     C
0    male  1 -99.0
1  female  2   3.0
2    male  3   4.0

In [ ]:
dp.A.replace(['male','female'],['1','0'],inplace=True)
dp

   A  B     C
0  1  1 -99.0
1  0  2   3.0
2  1  3   4.0

In [ ]:
dp.columns=['a','b','c']
dp

   a  b     c
0  1  1 -99.0
1  0  2   3.0
2  1  3   4.0

In [ ]:
mapping={'a':'Sexo','b':'Nro'}
dp.rename(columns=mapping).head(1)

  Sexo  Nro     c
0    1    1 -99.0

In [ ]:
my_list=[[230.1,37.8,69.2,22.1],[44.5,39.3,45.1,10.4],[17.2,45.9,69.3,9.3],[151.5,41.3,58.5,18.5]]
my_list
col_name=['TV','Radio','Newspaper','Sales']
dp=pd.DataFrame(my_list,columns=col_name)

In [ ]:
drop_name=['Newspaper','Sales']
dp=dp.drop(drop_name,axis=1)
dp

      TV  Radio
0  230.1   37.8
1   44.5   39.3
2   17.2   45.9
3  151.5   41.3

In [ ]:
dp

      TV  Radio  Newspaper  Sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5

* Filtros

In [ ]:
Base=dp[dp.Newspaper<50]
Base

     TV  Radio  Newspaper  Sales
1  44.5   39.3       45.1   10.4

In [ ]:
dp[(dp.Newspaper<60)&(dp.TV>100)]

      TV  Radio  Newspaper  Sales
3  151.5   41.3       58.5   18.5

In [ ]:
dp['Part_Tv']=dp.TV/sum(dp.TV)
dp

      TV  Radio  Newspaper  Sales   Part_Tv
0  230.1   37.8       69.2   22.1  0.519062
1   44.5   39.3       45.1   10.4  0.100383
2   17.2   45.9       69.3    9.3  0.038800
3  151.5   41.3       58.5   18.5  0.341755

In [ ]:
dp['cond']=dp.apply(lambda c: 1 if((c.TV>100)&(c.Radio<50)) else 2 if c.Sales>10 else 3,axis=1)
dp

      TV  Radio  Newspaper  Sales   Part_Tv  cond
0  230.1   37.8       69.2   22.1  0.519062     1
1   44.5   39.3       45.1   10.4  0.100383     2
2   17.2   45.9       69.3    9.3  0.038800     3
3  151.5   41.3       58.5   18.5  0.341755     1

In [ ]:
import numpy as np
dp['logTV']=np.log(dp.TV)
dp

      TV  Radio  Newspaper  Sales   Part_Tv  cond     logTV
0  230.1   37.8       69.2   22.1  0.519062     1  5.438514
1   44.5   39.3       45.1   10.4  0.100383     2  3.795489
2   17.2   45.9       69.3    9.3  0.038800     3  2.844909
3  151.5   41.3       58.5   18.5  0.341755     1  5.020586

In [ ]:
leftp = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']},
index=[0, 1, 2, 3])
rightp = pd.DataFrame({'A': ['A0', 'A1', 'A6', 'A7'],
'F': ['B4', 'B5', 'B6', 'B7'],
'G': ['C4', 'C5', 'C6', 'C7'],
'H': ['D4', 'D5', 'D6', 'D7']},
index=[4, 5, 6, 7])